zelveron/STM32FC/src/main.cpp
/**
 * STM32F407VET6 - BMP581 + BMI323 real-time streamer
 *
 *   BMP581 : I2C1  PB6=SCL, PB7=SDA @0x47  (pressure / temp / altitude)
 *   BMI323 : SPI1  PA5=SCK, PA6=MISO, PA7=MOSI, PA4=CS (accel / gyro)
 *   uBlox  : USART1 PA9=TX, PA10=RX (NMEA), en PE10
 *
 * Output over USB CDC ("SerialUSB"), tagged CSV lines:
 *   BMP,<pressure_hPa>,<temperature_C>,<altitude_m>
 *   BMI,<acc_x>,<acc_y>,<acc_z>,<gyr_x>,<gyr_y>,<gyr_z>   (g, deg/s)
 *   GPS,<lat>,<lon>,<alt_m>,<sats>,<fix>
 *   ATT,<roll_deg>,<pitch_deg>,<yaw_deg>
 *   SD_STATUS,1|<logfile>  (0 = SD init/open failed)
 *   BMI_STATUS,0|1       (0 = not detected, 1 = detected)
 *
 * Sensor data is also logged to the SD card (SDIO, FatFs) as FLTxxxxx.CSV.
 */

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <math.h>
#include <string.h>
#include <stdlib.h>

#include "bmp5.h"
#include "bmp5_defs.h"
#include "bmi323.h"
#include <STM32SD.h>

#define BMP_EN     PB11
#define BMP_EN_ALT PE11
#define BMI_CS     PA4
#define BMI_SCK    PA5
#define BMI_MISO   PA6
#define BMI_MOSI   PA7

static const uint8_t BMP5_ADDR = 0x47;

/* ------------------------------------------------------------------------- */
/* BMP581 (I2C)                                                              */
/* ------------------------------------------------------------------------- */

static int8_t bmp5_i2c_read(uint8_t reg_addr, uint8_t *read_data, uint32_t len, void *intf_ptr)
{
    (void)intf_ptr;
    Wire.beginTransmission(BMP5_ADDR);
    Wire.write(reg_addr);
    if (Wire.endTransmission(false) != 0) return BMP5_E_COM_FAIL;
    if (Wire.requestFrom((uint8_t)BMP5_ADDR, (uint8_t)len) != len) return BMP5_E_COM_FAIL;
    for (uint32_t i = 0; i < len; i++) read_data[i] = Wire.read();
    return BMP5_INTF_RET_SUCCESS;
}

static int8_t bmp5_i2c_write(uint8_t reg_addr, const uint8_t *write_data, uint32_t len, void *intf_ptr)
{
    (void)intf_ptr;
    Wire.beginTransmission(BMP5_ADDR);
    Wire.write(reg_addr);
    for (uint32_t i = 0; i < len; i++) Wire.write(write_data[i]);
    if (Wire.endTransmission() != 0) return BMP5_E_COM_FAIL;
    return BMP5_INTF_RET_SUCCESS;
}

static void bmp5_delay_us(uint32_t period, void *intf_ptr)
{
    (void)intf_ptr;
    delayMicroseconds(period);
}

static struct bmp5_dev bmp_dev;
static struct bmp5_osr_odr_press_config bmp_cfg;

static bool bmp5_begin(void)
{
    memset(&bmp_dev, 0, sizeof(bmp_dev));
    bmp_dev.intf     = BMP5_I2C_INTF;
    bmp_dev.read     = bmp5_i2c_read;
    bmp_dev.write    = bmp5_i2c_write;
    bmp_dev.delay_us = bmp5_delay_us;

    if (bmp5_init(&bmp_dev) != BMP5_OK) return false;

    bmp_cfg.osr_t    = BMP5_OVERSAMPLING_1X;
    bmp_cfg.osr_p    = BMP5_OVERSAMPLING_16X;
    bmp_cfg.press_en = BMP5_ENABLE;
    bmp_cfg.odr      = BMP5_ODR_100_2_HZ;

    if (bmp5_set_osr_odr_press_config(&bmp_cfg, &bmp_dev) != BMP5_OK) return false;
    return true;
}

/* ------------------------------------------------------------------------- */
/* ALS31300 3-axis Hall-effect sensor (I2C1 @0x60)                           */
/* ------------------------------------------------------------------------- */

#define ALS_ADDR 0x7E   /* found by I2C scan (126 decimal) */

static void als_write(uint8_t reg, const uint8_t *buf, uint8_t len)
{
    Wire.beginTransmission(ALS_ADDR);
    Wire.write(reg);
    for (uint8_t i = 0; i < len; i++) Wire.write(buf[i]);
    Wire.endTransmission();
}

static int  als_read_fail_stage = 0;   /* 0=ok, 1=write NACK, 2=short read */
static int  als_read_got = 0;          /* bytes received on short read */

static bool als_read(uint8_t reg, uint8_t *buf, uint8_t len)
{
    Wire.beginTransmission(ALS_ADDR);
    Wire.write(reg);
    if (Wire.endTransmission(false) != 0) { als_read_fail_stage = 1; return false; }
    int n = Wire.requestFrom((uint8_t)ALS_ADDR, len);
    if (n != len) { als_read_fail_stage = 2; als_read_got = n; return false; }
    for (uint8_t i = 0; i < len; i++) buf[i] = Wire.read();
    als_read_fail_stage = 0;
    return true;
}

/* One-time diagnostic: verify wake write + reads after als_begin(). */
static void als_debug_probe(void)
{
    uint8_t b[8];
    uint8_t v[4] = { 0x00, 0x00, 0x00, 0x00 };
    uint8_t cac_msb[4] = { 0x2C, 0x41, 0x35, 0x34 };
    uint8_t cac_lsb[4] = { 0x34, 0x35, 0x41, 0x2C };
    int r;

    /* Test 1: CAC unlock, MSB first, to 0x35. */
    Wire.beginTransmission(ALS_ADDR); Wire.write(0x35);
    for (int i = 0; i < 4; i++) Wire.write(cac_msb[i]);
    r = Wire.endTransmission();
    SerialUSB.print(F("ALS_PRB_CAC_MSB,")); SerialUSB.println(r);

    /* Test 2: CAC unlock, LSB first, to 0x35. */
    Wire.beginTransmission(ALS_ADDR); Wire.write(0x35);
    for (int i = 0; i < 4; i++) Wire.write(cac_lsb[i]);
    r = Wire.endTransmission();
    SerialUSB.print(F("ALS_PRB_CAC_LSB,")); SerialUSB.println(r);

    /* Test 3: write op mode 0x27 (active). */
    Wire.beginTransmission(ALS_ADDR); Wire.write(0x27);
    for (int i = 0; i < 4; i++) Wire.write(v[i]);
    r = Wire.endTransmission();
    SerialUSB.print(F("ALS_PRB_WAKE,")); SerialUSB.println(r);
    delayMicroseconds(600);

    /* Test 4: read op mode 0x27 (4 bytes). */
    SerialUSB.print(F("ALS_PRB_R27_4,"));
    if (als_read(0x27, b, 4))
    {
        for (int i = 0; i < 4; i++) { if (b[i] < 0x10) SerialUSB.print('0'); SerialUSB.print(b[i], HEX); if (i < 3) SerialUSB.print(','); }
        SerialUSB.println();
    }
    else
    {
        SerialUSB.print(F("FAIL,")); SerialUSB.print(als_read_fail_stage); SerialUSB.print(','); SerialUSB.println(als_read_got);
    }

    /* Test 5: read data 0x28 (8 bytes). */
    SerialUSB.print(F("ALS_PRB_R28_8,"));
    if (als_read(0x28, b, 8))
    {
        for (int i = 0; i < 8; i++) { if (b[i] < 0x10) SerialUSB.print('0'); SerialUSB.print(b[i], HEX); if (i < 7) SerialUSB.print(','); }
        SerialUSB.println();
    }
    else
    {
        SerialUSB.print(F("FAIL,")); SerialUSB.print(als_read_fail_stage); SerialUSB.print(','); SerialUSB.println(als_read_got);
    }

    /* --- Retry at a slow I2C clock (marginal-solder diagnosis) ---------- */
    Wire.setClock(10000);

    Wire.beginTransmission(ALS_ADDR); Wire.write(0x27);
    for (int i = 0; i < 4; i++) Wire.write(v[i]);
    r = Wire.endTransmission();
    SerialUSB.print(F("ALS_PRB_10K_WAKE,")); SerialUSB.println(r);
    delayMicroseconds(600);

