zelveron/STM32FC/src/main.cpp
/* Parse $GxRMC: UTC time + speed over ground (knots -> km/h). */
static bool gps_process_rmc(char *line)
{
    int len = (int)strlen(line);
    if (line[0] != '$' || line[3] != 'R' || line[4] != 'M' || line[5] != 'C')
        return false;
    if (len < 10 || line[len - 3] != '*') return false;
    uint8_t cs = 0;
    for (int i = 1; i < len - 3; i++) cs ^= (uint8_t)line[i];
    uint8_t cs_hex = (uint8_t)strtol(line + len - 2, NULL, 16);
    if (cs != cs_hex) return false;

    line[len - 3] = '\0';
    char *f[13];
    int n = gps_split(line, f, 13);
    if (n < 8) return false;

    gps_store_time(f[1]);
    if (f[7][0] != '\0') gps_speed_kmh = atof(f[7]) * 1.852f;  /* knots -> km/h */
    return true;
}

static bool gps_process_line(char *line)
{
    int len = (int)strlen(line);

    /* Match NMEA GGA sentences ($GPGGA / $GNGGA / $GLGGA / ...). */
    if (line[0] != '$' || line[3] != 'G' || line[4] != 'G' || line[5] != 'A')
        return false;

    /* Validate the trailing *XX checksum. */
    if (len < 10 || line[len - 3] != '*') return false;
    uint8_t cs = 0;
    for (int i = 1; i < len - 3; i++) cs ^= (uint8_t)line[i];
    uint8_t cs_hex = (uint8_t)strtol(line + len - 2, NULL, 16);
    if (cs != cs_hex) return false;

    line[len - 3] = '\0';            /* drop checksum before splitting */

    char *f[15];
    int n = gps_split(line, f, 15);

    /* Need fields through altitude unit (index 10). */
    if (n < 11) return false;

    int sats = atoi(f[7]);
    int fix  = atoi(f[6]);
    gps_sats = sats;
    gps_fix  = fix;
    gps_store_time(f[1]);

    /* Report fix quality + satellite count once per second, even with no
       position (lets us watch satellite acquisition). */
    static uint32_t last_gps_stat = 0;
    if ((millis() - last_gps_stat) >= 1000)
    {
        last_gps_stat = millis();
        SerialUSB.print(F("GPS_STAT,"));
        SerialUSB.print(fix);
        SerialUSB.print(',');
        SerialUSB.print(sats);
        SerialUSB.print(',');
        SerialUSB.print(gps_time_str);
        SerialUSB.print(',');
        SerialUSB.println(gps_speed_kmh, 1);
    }

    if (f[2][0] == '\0' || f[4][0] == '\0') return false;

    float lat_raw = atof(f[2]);
    float lat = (int)(lat_raw / 100.0f) + (lat_raw - (int)(lat_raw / 100.0f) * 100.0f) / 60.0f;
    if (f[3][0] == 'S') lat = -lat;

    float lon_raw = atof(f[4]);
    float lon = (int)(lon_raw / 100.0f) + (lon_raw - (int)(lon_raw / 100.0f) * 100.0f) / 60.0f;
    if (f[5][0] == 'W') lon = -lon;

    float gps_alt = atof(f[9]);

    SerialUSB.print(F("GPS,"));
    SerialUSB.print(lat, 6);
    SerialUSB.print(',');
    SerialUSB.print(lon, 6);
    SerialUSB.print(',');
    SerialUSB.print(gps_alt, 1);
    SerialUSB.print(',');
    SerialUSB.print(sats);
    SerialUSB.print(',');
    SerialUSB.print(fix);
    SerialUSB.print(',');
    SerialUSB.print(gps_time_str);
    SerialUSB.print(',');
    SerialUSB.println(gps_speed_kmh, 1);
    return true;
}

/* ------------------------------------------------------------------------- */
/* Data logging (SD card over SDIO, FatFs)                                   */
/* ------------------------------------------------------------------------- */

static float g_ax = 0, g_ay = 0, g_az = 0, g_gx = 0, g_gy = 0, g_gz = 0;
static float g_press = 0, g_temp = 0, g_alt = 0;

static File sd_file;
static bool sd_ok = false;
static char sd_log_name[16];

/* ------------------------------------------------------------------------- */
/* setup / loop                                                              */
/* ------------------------------------------------------------------------- */

void setup(void)
{
    pinMode(BMP_EN_ALT, OUTPUT); digitalWrite(BMP_EN_ALT, HIGH);
    pinMode(BMP_EN, OUTPUT);     digitalWrite(BMP_EN, HIGH);

    /* PC14: ALS enable (OSC32 pin - drive via registers) */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    GPIOC->MODER = (GPIOC->MODER & ~(3UL << 28)) | (1UL << 28);
    GPIOC->BSRR = (1UL << 14);

    pinMode(BMI_CS, OUTPUT);   digitalWrite(BMI_CS, HIGH);
    pinMode(BMI_SCK, OUTPUT);  digitalWrite(BMI_SCK, LOW);
    pinMode(BMI_MOSI, OUTPUT); digitalWrite(BMI_MOSI, LOW);
    pinMode(BMI_MISO, INPUT_PULLUP);

    Wire.setSCL(PB6);
    Wire.setSDA(PB7);
    Wire.begin();

    als_begin();

    SerialUSB.begin();
    gps_uart_begin(GPS_BAUD);

    /* Wait (bounded) for the USB host, draining uBlox boot burst meanwhile. */
    for (int i = 0; i < 300 && !SerialUSB; i++) { gps_drain(); delay(10); }
    delay(100);
    gps_drain();
    SerialUSB.println(F("boot: BMP581 + BMI323 + uBlox + SD streamer"));

    /* One-time I2C bus scan + ALS presence report. */
    i2c_scan();
    SerialUSB.print(F("ALS_STATUS,"));
    SerialUSB.println(als_present ? 1 : 0);
    als_debug_probe();
    gps_drain();

    /* --- SD card (SDIO 4-bit) + log file -------------------------------- */
    sd_ok = SD.begin();
    if (sd_ok)
    {
        int n = 0;
        do { snprintf(sd_log_name, sizeof(sd_log_name), "FLT%05d.CSV", n++); }
        while (SD.exists(sd_log_name));

        sd_file = SD.open(sd_log_name, FILE_WRITE);
        if (sd_file)
        {
            sd_file.println(F("t_ms,ax,ay,az,gx,gy,gz,roll,pitch,yaw,press_hPa,temp_c,alt_m,gps_time,gps_sats,gps_speed_kmh"));
            sd_file.flush();
            SerialUSB.print(F("SD_STATUS,1,"));
            SerialUSB.println(sd_log_name);
        }
        else
        {
            sd_ok = false;
            SerialUSB.println(F("SD_STATUS,0,open_failed"));
        }
    }
    else
    {
        SerialUSB.println(F("SD_STATUS,0,begin_failed"));
    }
}

void loop(void)
{
    /* --- uBlox GNSS: read NMEA over USART1 ------------------------------- */
    while (Serial1.available())
    {
        char c = (char)Serial1.read();
        gps_rx_bytes++;
        if (gps_first_len < sizeof(gps_first)) gps_first[gps_first_len++] = (uint8_t)c;
        if (c == '\n')
        {
            gps_line[gps_len] = '\0';
            if (gps_valid_nmea(gps_line))
            {
                gps_nmea_valid = true;
                strncpy(gps_last_nmea, gps_line, sizeof(gps_last_nmea) - 1);
                gps_last_nmea[sizeof(gps_last_nmea) - 1] = '\0';
            }
            if (gps_process_line(gps_line)) gps_locked = true;
            gps_process_rmc(gps_line);
            gps_len = 0;
        }
        else if (c != '\r' && gps_len < (sizeof(gps_line) - 1))
        {
            gps_line[gps_len++] = c;
        }
    }

    /* Baud auto-detect: cycle until we see a valid NMEA sentence. */
    if (!gps_nmea_valid && (millis() - gps_last_switch) >= 2000)
    {
        gps_last_switch = millis();
        gps_baud_idx = (uint8_t)((gps_baud_idx + 1) % (sizeof(GPS_BAUDS) / sizeof(GPS_BAUDS[0])));
        gps_uart_begin(GPS_BAUDS[gps_baud_idx]);
    }

    /* Active u-blox probe: poll version + enable NMEA every ~2 s. */
    static uint32_t last_ubx = 0;
    if ((millis() - last_ubx) >= 2000)
    {
        last_ubx = millis();
        ubx_poll_monver();
        ubx_enable_nmea();
    }

