zelveron/STM32FC/src/main.cpp
    /* Wiring diagnostic: listen on PA9 (swap test) + PA10 (RX-present test)
       every ~4 s. Edges > ~5 mean data traffic on that pin. */
    static uint32_t last_pa = 0;
    if ((millis() - last_pa) >= 4000)
    {
        last_pa = millis();
        uint32_t cur_baud = GPS_BAUDS[gps_baud_idx];
        Serial1.end();
        pinMode(PA9, INPUT_PULLUP);
        uint32_t e9 = pin_edge_count(PA9, 50000);    /* 50 ms window */
        int l9 = digitalRead(PA9);
        pinMode(PA10, INPUT_PULLUP);
        uint32_t e10 = pin_edge_count(PA10, 50000);  /* 50 ms window */
        int l10 = digitalRead(PA10);
        gps_uart_begin(cur_baud);
        SerialUSB.print(F("PA_EDGES,"));
        SerialUSB.print(e9);
        SerialUSB.print(',');
        SerialUSB.print(l9);
        SerialUSB.print(',');
        SerialUSB.print(e10);
        SerialUSB.print(',');
        SerialUSB.println(l10);
    }

    /* Debug: report rx byte count / baud / lock state every 2 s. */
    static uint32_t last_gps_dbg = 0;
    if ((millis() - last_gps_dbg) >= 2000)
    {
        last_gps_dbg = millis();
        SerialUSB.print(F("GPS_DBG,"));
        SerialUSB.print(gps_rx_bytes);
        SerialUSB.print(',');
        SerialUSB.print(GPS_BAUDS[gps_baud_idx]);
        SerialUSB.print(',');
        SerialUSB.println(gps_locked ? 1 : 0);
    }

    /* Show captured uBlox boot bytes (hex) every 3 s. */
    static uint32_t last_gps_first = 0;
    if ((millis() - last_gps_first) >= 3000)
    {
        last_gps_first = millis();
        SerialUSB.print(F("GPS_FIRST,"));
        SerialUSB.print(gps_first_len);
        SerialUSB.print(',');
        for (uint16_t i = 0; i < gps_first_len && i < 64; i++)
        {
            if (gps_first[i] < 0x10) SerialUSB.print('0');
            SerialUSB.print(gps_first[i], HEX);
        }
        SerialUSB.println();
    }

    /* Echo the most recent valid NMEA sentence (1 Hz). */
    static uint32_t last_nmea = 0;
    if (gps_nmea_valid && (millis() - last_nmea) >= 1000)
    {
        last_nmea = millis();
        SerialUSB.print(F("GPS_RAW,"));
        SerialUSB.println(gps_last_nmea);
    }

    /* --- BMI323 presence detection (retry every 1 s until found) --------- */
    static uint32_t last_bmi_retry = 0;
    if (!bmi_ready && (millis() - last_bmi_retry) >= 1000)
    {
        last_bmi_retry = millis();
        if (bmi323_begin())
        {
            bmi_ready = true;
            SerialUSB.println(F("BMI_STATUS,1"));
        }
        else
        {
            SerialUSB.println(F("BMI_STATUS,0"));
            uint8_t raw = bmi_raw_chip_id();
            SerialUSB.print(F("BMI_RAW,0x"));
            SerialUSB.println(raw, HEX);
        }
    }

    /* --- BMI323 streaming at ~100 Hz ------------------------------------- */
    static uint32_t last_bmi = 0;
    if (bmi_ready && (millis() - last_bmi) >= 10)
    {
        last_bmi = millis();

        struct bmi3_sensor_data data[2];
        data[0].type = BMI323_ACCEL;
        data[1].type = BMI323_GYRO;
        if (bmi323_get_sensor_data(data, 2, &bmi_dev) == BMI3_OK)
        {
            float ax = (float)data[0].sens_data.acc.x * 4.0f / 32768.0f;
            float ay = (float)data[0].sens_data.acc.y * 4.0f / 32768.0f;
            float az = (float)data[0].sens_data.acc.z * 4.0f / 32768.0f;
            float gx = (float)data[1].sens_data.gyr.x * 2000.0f / 32768.0f;
            float gy = (float)data[1].sens_data.gyr.y * 2000.0f / 32768.0f;
            float gz = (float)data[1].sens_data.gyr.z * 2000.0f / 32768.0f;

            att_update(ax, ay, az, gx, gy, gz);
            g_ax = ax; g_ay = ay; g_az = az;
            g_gx = gx; g_gy = gy; g_gz = gz;

            SerialUSB.print(F("BMI,"));
            SerialUSB.print(ax, 4);
            SerialUSB.print(',');
            SerialUSB.print(ay, 4);
            SerialUSB.print(',');
            SerialUSB.print(az, 4);
            SerialUSB.print(',');
            SerialUSB.print(gx, 2);
            SerialUSB.print(',');
            SerialUSB.print(gy, 2);
            SerialUSB.print(',');
            SerialUSB.println(gz, 2);
        }
        else
        {
            /* Read failed - drop out of ready so we re-initialize. */
            bmi_ready = false;
            SerialUSB.println(F("BMI_STATUS,0"));
        }
    }

    /* --- Attitude output at ~20 Hz --------------------------------------- */
    static uint32_t last_att_out = 0;
    if (bmi_ready && (millis() - last_att_out) >= 50)
    {
        last_att_out = millis();
        SerialUSB.print(F("ATT,"));
        SerialUSB.print(att_roll, 1);
        SerialUSB.print(',');
        SerialUSB.print(att_pitch, 1);
        SerialUSB.print(',');
        SerialUSB.println(att_yaw, 1);
    }

    /* --- BMP581 streaming at ~10 Hz -------------------------------------- */
    static uint32_t last_bmp = 0;
    if ((millis() - last_bmp) >= 100)
    {
        last_bmp = millis();

        static bool bmp_ok = false;
        if (!bmp_ok)
        {
            bmp_ok = bmp5_begin();
        }

        if (bmp_ok)
        {
            bmp5_set_power_mode(BMP5_POWERMODE_FORCED, &bmp_dev);
            delay(30);

            struct bmp5_sensor_data data;
            if (bmp5_get_sensor_data(&data, &bmp_cfg, &bmp_dev) == BMP5_OK)
            {
                float p = data.pressure;
                float t = data.temperature;
                float alt = 44330.0f * (1.0f - powf(p / 101325.0f, 0.1902632f));

                g_press = p / 100.0f;
                g_temp  = t;
                g_alt   = alt;

                SerialUSB.print(F("BMP,"));
                SerialUSB.print(p / 100.0f, 3);
                SerialUSB.print(',');
                SerialUSB.print(t, 2);
                SerialUSB.print(',');
                SerialUSB.println(alt, 2);
            }
        }
    }

    /* --- ALS31300 reading at ~10 Hz (only if present) -------------------- */
    static uint32_t last_als = 0;
    if (als_present && (millis() - last_als) >= 100)
    {
        last_als = millis();
        int16_t ax_, ay_, az_, at_;
        uint8_t raw[8];
        if (als_get(&ax_, &ay_, &az_, &at_, raw))
        {
            float temp_c = 302.0f * ((float)at_ - 1708.0f) / 4096.0f;
            SerialUSB.print(F("ALS,"));
            SerialUSB.print(ax_);
            SerialUSB.print(',');
            SerialUSB.print(ay_);
            SerialUSB.print(',');
            SerialUSB.print(az_);
            SerialUSB.print(',');
            SerialUSB.println(temp_c, 1);
        }
    }

