zelveron/STM32FC/src/main.cpp
    /* --- ALS31300 raw bytes at ~2 Hz (only if present) -------------------- */
    static uint32_t last_als_raw = 0;
    if (als_present && (millis() - last_als_raw) >= 500)
    {
        last_als_raw = millis();
        uint8_t raw[8];
        if (als_read(0x28, raw, 8))
        {
            SerialUSB.print(F("ALS_RAW,"));
            for (int i = 0; i < 8; i++)
            {
                if (raw[i] < 0x10) SerialUSB.print('0');
                SerialUSB.print(raw[i], HEX);
                if (i < 7) SerialUSB.print(',');
            }
            SerialUSB.println();
        }
    }

    /* --- SD data log at ~50 Hz ------------------------------------------- */
    static uint32_t last_sd_log = 0;
    if (sd_ok && bmi_ready && (millis() - last_sd_log) >= 20)
    {
        last_sd_log = millis();

        sd_file.print(millis());
        sd_file.print(',');
        sd_file.print(g_ax, 4); sd_file.print(',');
        sd_file.print(g_ay, 4); sd_file.print(',');
        sd_file.print(g_az, 4); sd_file.print(',');
        sd_file.print(g_gx, 2); sd_file.print(',');
        sd_file.print(g_gy, 2); sd_file.print(',');
        sd_file.print(g_gz, 2); sd_file.print(',');
        sd_file.print(att_roll, 1); sd_file.print(',');
        sd_file.print(att_pitch, 1); sd_file.print(',');
        sd_file.print(att_yaw, 1); sd_file.print(',');
        sd_file.print(g_press, 3); sd_file.print(',');
        sd_file.print(g_temp, 2); sd_file.print(',');
        sd_file.print(g_alt, 2); sd_file.print(',');
        sd_file.print(gps_time_str); sd_file.print(',');
        sd_file.print(gps_sats); sd_file.print(',');
        sd_file.println(gps_speed_kmh, 1);

        static uint32_t last_sd_sync = 0;
        if ((millis() - last_sd_sync) >= 1000)
        {
            last_sd_sync = millis();
            sd_file.flush();
        }
    }

    /* --- SD status debug every 5 s --------------------------------------- */
    static uint32_t last_sd_dbg = 0;
    if ((millis() - last_sd_dbg) >= 5000)
    {
        last_sd_dbg = millis();
        SerialUSB.print(F("SD_DBG,"));
        SerialUSB.print(sd_ok ? 1 : 0);
        SerialUSB.print(F(","));
        SerialUSB.print(sd_log_name);
        SerialUSB.println();
    }
}
